izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/display_thread.cpp
        if (write_FROM == true || reset_FROM == true)
        {
            while (thread_data->stop == 0)
            {
                if (write_FROM == true)
                {
                    console::info("HID VFD - FROM write start");
                    if (display_write_FROM(hid) != -1)
                    {
                        Sleep(3000);
                        console::info("HID VFD - FROM write success");
                        display_draw_ascii(hid, 0, 0, 0, 20, ' ', "FROM WRITE SUCCESS");
                    }
                    else
                    {
                        Sleep(3000);
                        console::info("HID VFD - FROM write fail");
                        display_draw_ascii(hid, 0, 0, 0, 20, ' ', "FROM WRITE FAIL");
                    }
                    display_draw_ascii(hid, 0, 1, 0, 20, ' ', "PLEASE RESTART FB2K");
                    write_FROM = false;
                    reset_FROM = false;
                }
                else if (reset_FROM == true)
                {
                    console::info("HID VFD - FROM reset start");
                    if (display_reset_FROM(hid) != -1)
                    {
                        Sleep(3000);
                        console::info("HID VFD - FROM reset success");
                        display_draw_ascii(hid, 0, 0, 0, 20, ' ', "FROM RESET SUCCESS");
                    }
                    else
                    {
                        Sleep(3000);
                        console::info("HID VFD - FROM reset fail");
                        display_draw_ascii(hid, 0, 0, 0, 20, ' ', "FROM RESET FAIL");
                    }
                    reset_FROM = false;
                    write_FROM = false;
                }
                Sleep(100);
            }
        }

        Sleep(1);

        end_clock = clock();
        code_exec_time = (uint16_t)(end_clock - start_clock);
    }
    if (cfg_onexit_power <= 3)
    {
        display_set_power(hid, 1);
        display_set_dim(hid, cfg_onexit_power);
        display_draw_utf8(hid, LINE1_START_X, 0, 0, LINE1_LEN, ' ', cfg_onstop_string1);
        display_draw_utf8(hid, LINE2_START_X, 1, 0, LINE2_LEN, ' ', cfg_onstop_string2);
    }
    else if (cfg_onexit_power == 4)
    {
        display_set_power(hid, 1);
        display_clear_screen(hid);
    }
    else if (cfg_onexit_power == 5)
    {
        display_set_power(hid, 0);
    }
    display_deinit(hid);
    thread_data->stop = 0;
    console::info("HID VFD - Thread stop");
    return 0;
}

int DisplayThread::start(unsigned short vid, unsigned short pid)
{
    uint32_t timeout_counter;

    memset(&thread_data, 0x00, sizeof(DisplayThreadData));
    thread_data.vid = vid;
    thread_data.pid = pid;
    thread_handle = CreateThread(NULL, 0, main_display_thread, &thread_data, 0, NULL);
    if (thread_handle == NULL)
    {
        return -1;
    }
    timeout_counter = 0;
    while (true)
    {
        if (thread_data.status == 1)
        {
            OutputDebugStringA("Display thread running\n");
            static_api_ptr_t<play_callback_manager>()->register_callback(this, this->get_flags(), false);
            return 0;
        }
        else if (thread_data.status == -1)
        {
            OutputDebugStringA("Display thread start fail\n");
            return -1;
        }
        else
        {
            if (timeout_counter >= 3000)
            {
                OutputDebugStringA("Display thread start fail\n");
                return -1;
            }
            timeout_counter++;
            Sleep(1);
        }
    }
    return -1;
}

int DisplayThread::stop(void)
{
    uint32_t timeout_counter;

    if (thread_handle == NULL || thread_handle == INVALID_HANDLE_VALUE || thread_data.status < 0)
    {
        return 0;
    }
    static_api_ptr_t<play_callback_manager>()->unregister_callback(this);
    thread_data.stop = 1;
    timeout_counter = 0;
    while (thread_data.stop == 1)
    {
        if (timeout_counter >= 3000)
        {
            OutputDebugStringA("Display thread stop fail\n");
            return -1;
        }
        timeout_counter++;
        Sleep(1);
    }
    CloseHandle(thread_handle);
    thread_handle = INVALID_HANDLE_VALUE;
    OutputDebugStringA("Display thread exit\n");
    return 0;
}

void DisplayThread::format_line1(const char* format)
{
    uint32_t formatter_str_len;
    titleformat_object::ptr formatter_script;
    pfc::string_formatter formatter_str;
    static_api_ptr_t<playback_control> m_playback_control;
    static_api_ptr_t<titleformat_compiler>()->compile_safe_ex(formatter_script, format);
    if (m_playback_control->playback_format_title(NULL, formatter_str, formatter_script, NULL, playback_control::display_level_all) == true)
    {
        thread_data.play_info.str_line1_avaliable = false;
        memset(thread_data.play_info.str_line_1, '\0', sizeof(thread_data.play_info.str_line_1));
        formatter_str_len = strlen(formatter_str);
        if (formatter_str_len >= sizeof(thread_data.play_info.str_line_1))
        {
            memcpy(thread_data.play_info.str_line_1, formatter_str, sizeof(thread_data.play_info.str_line_1) - 1);
        }
        else
        {
            memcpy(thread_data.play_info.str_line_1, formatter_str, formatter_str_len);
        }
        thread_data.play_info.str_line1_avaliable = true;
    }
}

void DisplayThread::format_line2(const char* format)
{
    uint32_t formatter_str_len;
    titleformat_object::ptr formatter_script;
    pfc::string_formatter formatter_str;
    static_api_ptr_t<playback_control> m_playback_control;
    static_api_ptr_t<titleformat_compiler>()->compile_safe_ex(formatter_script, format);
    if (m_playback_control->playback_format_title(NULL, formatter_str, formatter_script, NULL, playback_control::display_level_all) == true)
    {
        thread_data.play_info.str_line2_avaliable = false;
        memset(thread_data.play_info.str_line_2, '\0', sizeof(thread_data.play_info.str_line_2));
        formatter_str_len = strlen(formatter_str);
        if (formatter_str_len >= sizeof(thread_data.play_info.str_line_2))
        {
            memcpy(thread_data.play_info.str_line_2, formatter_str, sizeof(thread_data.play_info.str_line_2) - 1);
        }
        else
        {
            memcpy(thread_data.play_info.str_line_2, formatter_str, formatter_str_len);
        }
        thread_data.play_info.str_line2_avaliable = true;
        thread_data.play_info.update_str_line2 = true;
    }
}

void DisplayThread::on_playback_starting(play_control::t_track_command p_command, bool p_paused)
{
    format_line1(cfg_onplay_format1);
    format_line2(cfg_onplay_format2);
    thread_data.play_info.play_state = PLAY_STATE_LOADING;
    thread_data.play_info.update_play_state = true;
}

void DisplayThread::on_playback_new_track(metadb_handle_ptr p_track)
{
    static_api_ptr_t<playback_control> m_playback_control;
    format_line1(cfg_onplay_format1);
    format_line2(cfg_onplay_format2);
    thread_data.play_info.volume = m_playback_control->get_volume();
    thread_data.play_info.play_state = PLAY_STATE_PLAY;
    thread_data.play_info.is_new_track = true;
    thread_data.play_info.update_play_state = true;
}

void DisplayThread::on_playback_stop(play_control::t_stop_reason p_reason)
{
    if (p_reason != play_control::stop_reason_starting_another)
    {
        thread_data.play_info.play_state = PLAY_STATE_STOP;
        thread_data.play_info.update_play_state = true;
    }
}

void DisplayThread::on_playback_pause(bool p_state)
{
    if (p_state == false)
    {
        thread_data.play_info.play_state = PLAY_STATE_PLAY;
    }
    else
    {
        thread_data.play_info.play_state = PLAY_STATE_PAUSE;
    }
    thread_data.play_info.update_play_state = true;
}

void DisplayThread::on_playback_edited(metadb_handle_ptr p_track)
{
    thread_data.play_info.is_new_track = true;
    format_line1(cfg_onplay_format1);
}

void DisplayThread::on_playback_time(double p_time)
{
    format_line2(cfg_onplay_format2);
}

void DisplayThread::on_volume_change(float p_new_val)
{
    thread_data.play_info.volume = p_new_val;
    thread_data.play_info.update_volume = true;
}

unsigned int DisplayThread::get_flags(void)
{
    return ((flag_on_playback_all | flag_on_volume_change) & ~flag_on_playback_dynamic_info & ~flag_on_playback_dynamic_info_track & ~flag_on_playback_seek);
}









/* 以下为测试时使用的功能，仅供参考。 按Ctrl+K+C注译选中的代码，Ctrl+K+U取消注译选中的代码。 */

