izilzty/foo_usbhid_m202md28a/foo_usbhid_m202md28a/src/display_thread.cpp
        //if (update_play_state == true) /* 播放状态和第一行文字更改时更新图标和亮度 */
        //{
        //	switch (play_info->play_state)
        //	{
        //	case PLAY_STATE_STOP:
        //		display_set_cp_user(hid);
        //		display_draw_ascii(hid, 0, 0, 0, 2, ' ', "\x80");
        //		display_set_cp_utf8(hid);
        //		if (cfg_onstop_power <= 3)
        //		{
        //			display_set_power(hid, 1);
        //			display_set_dim(hid, cfg_onstop_power);
        //		}
        //		else if (cfg_onstop_power == 4)
        //		{
        //			display_set_power(hid, 1);
        //			display_clear_screen(hid);
        //			update_volume = false;
        //			update_line1 = false;
        //			update_line2 = false;
        //		}
        //		else if (cfg_onstop_power == 5)
        //		{
        //			display_set_power(hid, 0);
        //		}
        //		break;
        //	case PLAY_STATE_PLAY:
        //		display_draw_utf8(hid, 0, 0, 0, 2, ' ', u8"▷");
        //		if (cfg_onplay_power <= 3)
        //		{
        //			display_set_power(hid, 1);
        //			display_set_dim(hid, cfg_onplay_power);
        //		}
        //		else if (cfg_onplay_power == 4)
        //		{
        //			display_set_power(hid, 1);
        //			display_clear_screen(hid);
        //			update_volume = false;
        //			update_line1 = false;
        //			update_line2 = false;
        //		}
        //		else if (cfg_onplay_power == 5)
        //		{
        //			display_set_power(hid, 0);
        //		}
        //		break;
        //	case PLAY_STATE_PAUSE:
        //		display_set_cp_user(hid);
        //		display_draw_ascii(hid, 0, 0, 0, 2, ' ', "\x81");
        //		display_set_cp_utf8(hid);
        //		if (cfg_onpause_power <= 3)
        //		{
        //			display_set_power(hid, 1);
        //			display_set_dim(hid, cfg_onpause_power);
        //		}
        //		else if (cfg_onpause_power == 4)
        //		{
        //			display_set_power(hid, 1);
        //			display_clear_screen(hid);
        //			update_volume = false;
        //			update_line1 = false;
        //			update_line2 = false;
        //		}
        //		else if (cfg_onpause_power == 5)
        //		{
        //			display_set_power(hid, 0);
        //		}
        //		break;
        //	case PLAY_STATE_LOADING:
        //		display_set_cp_user(hid);
        //		display_draw_ascii(hid, 0, 0, 0, 2, ' ', "\x82");
        //		display_set_cp_utf8(hid);
        //		break;
        //	}
        //	update_play_state = false;
        //}

        //if (update_scroll == true) /* 第一行文字滚动初始化 */
        //{

        //	update_scroll = false;
        //}


        //if (play_info.play_state == PLAY_STATE_PLAY)
        //{
        //	if (scroll_delay_count < 10)
        //	{
        //		scroll_delay_count += 1;
        //	}
        //	else
        //	{
        //		scroll_delay_count = 0;
        //		scroll_pos -= 1;
        //		if (*play_info.str_line_1 != '\0')
        //		{
        //			display_scroll_utf8(play_info.str_line_1, scroll_pos, 20, scroll_str, sizeof(scroll_str));
        //			update_line1 = true;
        //		}
        //	}
        //}
        //if (update_volume == true)
        //{
        //	//snprintf(volume_str, sizeof(volume_str), "%s%06.1f%s", "  Volume: ", play_info.volume, "dB");
        //	//display_draw_utf8(hid, 0, 1, 0, 20, ' ', volume_str);
        //	update_volume = false;
        //	update_line2 = true;
        //	scroll_delay_count = 1000;
        //	OutputDebugStringA("Update Volume\n");
        //}
        //else
        //{
        //	//if (scroll_delay_count > 0 && scroll_delay_count - total_time > 0)
        //	//{
        //		//scroll_delay_count -= total_time;
        //	//}
        //	//else
        //	//{
        //		//scroll_delay_count = 0;
        //	if (update_line2 == true)
        //	{
        //		switch (play_info.play_state)
        //		{
        //		case PLAY_STATE_STOP:
        //			if (*cfg_onstop_string2 != '\0')
        //			{
        //				display_draw_utf8(hid, 0, 1, 0, 20, ' ', cfg_onstop_string2);
        //			}
        //			else
        //			{
        //				display_draw_utf8(hid, 0, 1, 0, 20, ' ', play_info.str_line_2);
        //			}
        //			break;
        //		case PLAY_STATE_PLAY:
        //			display_draw_utf8(hid, 0, 1, 0, 20, ' ', play_info.str_line_2);
        //			break;
        //		case PLAY_STATE_PAUSE:
        //			display_draw_utf8(hid, 0, 1, 0, 20, ' ', play_info.str_line_2);
        //			break;
        //		case PLAY_STATE_LOADING:
        //			if (*cfg_onload_string2 != '\0')
        //			{
        //				display_draw_utf8(hid, 0, 1, 0, 20, ' ', cfg_onload_string2);
        //			}
        //			else
        //			{
        //				display_draw_utf8(hid, 0, 1, 0, 20, ' ', play_info.str_line_2);
        //			}
        //			break;
        //		}
        //		update_line2 = false;
        //		OutputDebugStringA("Update line 2\n");
        //		//}
        //	}
        //}
        //if (update_line1 == true)
        //{
        //	scroll_delay_count = 0;
        //	switch (play_info.play_state)
        //	{
        //	case PLAY_STATE_STOP:
        //		if (*cfg_onstop_string1 != '\0')
        //		{
        //			display_draw_utf8(hid, 2, 0, 0, 18, ' ', cfg_onstop_string1);
        //		}
        //		else
        //		{
        //			display_draw_utf8(hid, 2, 0, 0, 18, ' ', scroll_str);
        //		}
        //		break;
        //	case PLAY_STATE_PLAY:
        //		display_draw_utf8(hid, 2, 0, 0, 18, ' ', scroll_str);
        //		break;
        //	case PLAY_STATE_PAUSE:
        //		display_draw_utf8(hid, 2, 0, 0, 18, ' ', scroll_str);
        //		break;
        //	case PLAY_STATE_LOADING:
        //		if (*cfg_onload_string1 != '\0')
        //		{
        //			display_draw_utf8(hid, 2, 0, 0, 18, ' ', cfg_onload_string1);
        //		}
        //		else
        //		{
        //			display_draw_utf8(hid, 2, 0, 0, 18, ' ', scroll_str);
        //		}
        //		break;
        //	}
        //	update_line1 = false;
        //	OutputDebugStringA("Update line 1\n");
        //}
        //Sleep(1);
